### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cms_function_app.azurerm_storage_queue.sync-activations-from-legacy-poison will be created
  + resource "azurerm_storage_queue" "sync-activations-from-legacy-poison" {
      + id                   = (known after apply)
      + name                 = "sync-activations-from-legacy-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsvccmsst01"
    }

  # module.postgres.azurerm_key_vault_secret.pgres_flex_admin_pwd will be created
  + resource "azurerm_key_vault_secret" "pgres_flex_admin_pwd" {
      + content_type            = "string"
      + expiration_date         = "2025-04-28T23:59:59Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv"
      + name                    = "pgres-flex-admin-pwd"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgres.azurerm_key_vault_secret.pgres_flex_readonly_usr_pwd will be created
  + resource "azurerm_key_vault_secret" "pgres_flex_readonly_usr_pwd" {
      + content_type            = "string"
      + expiration_date         = "2026-02-19T23:59:59Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv"
      + name                    = "pgres-flex-readonly-usr-pwd"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgres.azurerm_key_vault_secret.pgres_flex_reviewer_usr_pwd will be created
  + resource "azurerm_key_vault_secret" "pgres_flex_reviewer_usr_pwd" {
      + content_type            = "string"
      + expiration_date         = "2025-04-28T23:59:59Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv"
      + name                    = "pgres-flex-reviewer-usr-pwd"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgres.random_password.postgres_admin_password["1682602957131"] will be created
  + resource "random_password" "postgres_admin_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 3
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.postgres.random_password.postgres_readonly_usr_password["1682602957131"] will be created
  + resource "random_password" "postgres_readonly_usr_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 3
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.postgres.random_password.postgres_reviewer_usr_password["1682602957131"] will be created
  + resource "random_password" "postgres_reviewer_usr_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 3
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "ACTIVATIONS_CONTAINER_NAME"                                                                       = "activations"
          + "AzureWebJobs.ActivationsSyncFromLegacy.Disabled"                                                  = "1"
          ~ "LEGACY_COSMOSDB_CONTAINER_ACTIVATIONS_LEASE"                                                      = "activations-ingestion-lease" -> "activations-sync-lease"
          + "STORAGE_ACCOUNT_NAME"                                                                             = "iopitnsvccmsst01"
          + "SYNCH_ACTIVATIONS_FROM_LEGACY_POISON_QUEUE"                                                       = "sync-activations-from-legacy-poison"
            # (130 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01"
        name                                           = "io-p-itn-svc-cms-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "2.0.0"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsWebHost__hostid",
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              - "AzureWebJobs.IngestionActivationWatcher.Disabled",
              - "AzureWebJobs.IngestionServiceHistoryWatcher.Disabled",
              - "AzureWebJobs.IngestionServiceLifecycleWatcher.Disabled",
              - "AzureWebJobs.IngestionServicePublicationWatcher.Disabled",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.LegacyServiceWatcher.Disabled",
              - "AzureWebJobs.OnRequestActivationIngestionRetry.Disabled",
              - "AzureWebJobs.OnRequestDeletion.Disabled",
              - "AzureWebJobs.OnRequestDetail.Disabled",
              + "AzureWebJobs.ServiceLifecycleWatcher.Disabled",
              + "AzureWebJobs.ServicePublicationWatcher.Disabled",
              + "AzureWebJobs.ServiceReviewChecker.Disabled",
              + "AzureWebJobs.ServiceHistoryWatcher.Disabled",
                "AzureWebJobs.OnRequestHistoricization.Disabled",
                # (1 unchanged element hidden)
                "AzureWebJobs.OnRequestReview.Disabled",
              - "AzureWebJobs.OnRequestReviewLegacy.Disabled",
              - "AzureWebJobs.OnRequestServicesHistoryIngestionRetry.Disabled",
              - "AzureWebJobs.OnRequestServicesLifecycleIngestionRetry.Disabled",
              - "AzureWebJobs.OnRequestServicesPublicationIngestionRetry.Disabled",
                "AzureWebJobs.OnRequestSyncCms.Disabled",
                "AzureWebJobs.OnRequestSyncLegacy.Disabled",
              + "AzureWebJobs.OnRequestReviewLegacy.Disabled",
              + "AzureWebJobs.ServiceReviewLegacyChecker.Disabled",
                "AzureWebJobs.OnRequestValidation.Disabled",
              - "AzureWebJobs.SelfcareGroupWatcher.Disabled",
              + "AzureWebJobs.OnRequestDeletion.Disabled",
              + "AzureWebJobs.OnRequestDetail.Disabled",
                "AzureWebJobs.ServiceDetailLifecycleWatcher.Disabled",
                "AzureWebJobs.ServiceDetailPublicationWatcher.Disabled",
              - "AzureWebJobs.ServiceHistoryWatcher.Disabled",
              - "AzureWebJobs.ServiceLifecycleWatcher.Disabled",
              - "AzureWebJobs.ServicePublicationWatcher.Disabled",
              - "AzureWebJobs.ServiceReviewChecker.Disabled",
              - "AzureWebJobs.ServiceReviewLegacyChecker.Disabled",
              + "AzureWebJobs.IngestionServicePublicationWatcher.Disabled",
              + "AzureWebJobs.OnRequestServicesPublicationIngestionRetry.Disabled",
              + "AzureWebJobs.IngestionServiceLifecycleWatcher.Disabled",
              + "AzureWebJobs.OnRequestServicesLifecycleIngestionRetry.Disabled",
              + "AzureWebJobs.IngestionServiceHistoryWatcher.Disabled",
              + "AzureWebJobs.OnRequestServicesHistoryIngestionRetry.Disabled",
                "AzureWebJobs.ServiceTopicsIngestor.Disabled",
              - "SLOT_TASK_HUBNAME",
              - "AzureFunctionsJobHost__extensions__durableTask__hubName",
              - "AzureFunctionsWebHost__hostid",
              + "AzureWebJobs.SelfcareGroupWatcher.Disabled",
              + "AzureWebJobs.IngestionActivationWatcher.Disabled",
              + "AzureWebJobs.OnRequestActivationIngestionRetry.Disabled",
              + "AzureWebJobs.ActivationsSyncFromLegacy.Disabled",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "ACTIVATIONS_CONTAINER_NAME"                                                                       = "activations"
          + "AzureWebJobs.ActivationsSyncFromLegacy.Disabled"                                                  = "1"
          ~ "LEGACY_COSMOSDB_CONTAINER_ACTIVATIONS_LEASE"                                                      = "activations-ingestion-lease" -> "activations-sync-lease"
          + "STORAGE_ACCOUNT_NAME"                                                                             = "iopitnsvccmsst01"
          + "SYNCH_ACTIVATIONS_FROM_LEGACY_POISON_QUEUE"                                                       = "sync-activations-from-legacy-poison"
            # (130 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "2.0.0"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_management_lock.this[0] will be created
  + resource "azurerm_management_lock" "this" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-itn-svc-cms-psql-01"
      + notes      = "Locked via Terraform"
      + scope      = (known after apply)
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["active_connections"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-ACTIVE_CONNECTIONS"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "active_connections"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["connections_failed"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-CONNECTIONS_FAILED"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "connections_failed"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["cpu_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-CPU_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["memory_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-MEMORY_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["storage_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-STORAGE_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_postgresql_flexible_server.this will be created
  + resource "azurerm_postgresql_flexible_server" "this" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = true
      + backup_retention_days         = 7
      + create_mode                   = "Default"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-svc-cms-psql-01"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "io-p-itn-svc-rg-01"
      + sku_name                      = "GP_Standard_D2ds_v5"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + version                       = "16"
      + zone                          = "1"

      + authentication (known after apply)

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 3
          + start_hour   = 2
          + start_minute = 0
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_postgresql_flexible_server_configuration.pgbouncer[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgbouncer" {
      + id        = (known after apply)
      + name      = "pgbouncer.enabled"
      + server_id = (known after apply)
      + value     = "true"
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_private_endpoint.postgre_pep will be created
  + resource "azurerm_private_endpoint" "postgre_pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-cms-psql-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-cms-psql-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.postgres.module.pgres_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.20.16.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-svc-pgres-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "dlg-Microsoft.DBforPostgreSQL-flexibleServers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.postgres_snet.module.pgres_snet.azurerm_subnet.this will be destroyed
  # (because azurerm_subnet.this is not in configuration)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                              = [
          - "10.20.16.0/24",
        ] -> null
      - default_outbound_access_enabled               = true -> null
      - id                                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-pgres-snet-01" -> null
      - name                                          = "io-p-itn-svc-pgres-snet-01" -> null
      - private_endpoint_network_policies             = "Disabled" -> null
      - private_link_service_network_policies_enabled = true -> null
      - resource_group_name                           = "io-p-itn-common-rg-01" -> null
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
      - virtual_network_name                          = "io-p-itn-common-vnet-01" -> null
    }

Plan: 17 to add, 2 to change, 1 to destroy.
```

</details>
